**2023-02-02 `09-SQL - Day 1 - Introduction to SQL`**

Project One is DONE!  I can't tell you how proud I am of the final products and deliveries of each and everyone of you!  It's time to get back to lectures and learning some new and extremely useful tools for Data Professional Career.  Next class, we start SQL, this language will be used by every one of you in one form or another no matter what type of Data Profession you go into.
Here are some specific links to what we are doing next class:
* [PostGres Create Database](https://www.tutorialspoint.com/postgresql/postgresql_create_database.htm)
* [PostGres Create Table](https://www.tutorialspoint.com/postgresql/postgresql_create_table.htm)
* [PostGres Data Types](https://www.tutorialspoint.com/postgresql/postgresql_data_types.htm)
* [SQL Primary Key](https://www.tutorialspoint.com/sql/sql-primary-key.htm)

Please ensure you can open PGAdmin AND expand the "Servers" list.  If you cannot please come to office hours.  If you do not have things properly set up and do not show up to office hours, you will have to go to breakout with TA and you might miss some of the lecture.

* [Visual Explanation of Joins](https://dataschool.com/how-to-teach-people-sql/sql-join-types-explained-visually/)
* [Another Visual Explanation of Joins](https://blog.codinghorror.com/a-visual-explanation-of-sql-joins/)
* [Try out SQL in browser](https://sqlzoo.net/)

**Objectives**

- Install and run Postgres and pgAdmin on your computers.
- Create a database and tables using pgAdmin.
- Define SQL data types, primary keys, and unique values.
- Load CSV files into a database and query the data.
- Articulate the four basic functions of persistent storage (CRUD) and apply this set of functions to a database.
- Combine data from multiple tables using JOINs.

**Install**
* [Postgres & pgAdmin for Windows](https://ucb.bootcampcontent.com/UCB-Coding-Bootcamp/UCB-VIRT-DATA-PT-11-2022-U-LOLC/-/blob/main/09-SQL/Supplemental/InstallationGuides/pgAdmin_and_Postgres_for_Windows.md)
* [Postgres & pgAdmin for Mac](https://ucb.bootcampcontent.com/UCB-Coding-Bootcamp/UCB-VIRT-DATA-PT-11-2022-U-LOLC/-/blob/main/09-SQL/Supplemental/InstallationGuides/pgAdmin_and_Postgres_for_Mac.md)

**Resources**
* [SQL Troubleshooting Guide](https://ucb.bootcampcontent.com/UCB-Coding-Bootcamp/UCB-VIRT-DATA-PT-11-2022-U-LOLC/-/blob/main/09-SQL/Supplemental/SQL_troubleshooting_guide.md)
* [SQL reference guide](https://ucb.bootcampcontent.com/UCB-Coding-Bootcamp/UCB-VIRT-DATA-PT-11-2022-U-LOLC/-/blob/main/09-SQL/Supplemental/SQL_reference_guide.pdf)
* [PostgreSQL Data Types](https://www.postgresql.org/docs/13/datatype.html)
* [postgresql_data_types](https://www.tutorialspoint.com/postgresql/postgresql_data_types.htm)

**Presentation**
* [09-1-Intro-to-SQL](https://ucb.bootcampcontent.com/UCB-Coding-Bootcamp/UCB-VIRT-DATA-PT-11-2022-U-LOLC/-/blob/main/slides/Data-09.1_Introduction_to_SQL.pdf)

# ==========================================

### 1.01 Everyone Do: Create a Database (5 mins)

* Open pgAdmin in a new browser window and ensure that everyone is able to follow along and view their new server in the browser.
![browser-view.png](../../images/browser-view.png)

  * In the pgAdmin editor, right-click the newly established server to create a new database.

  * From the menu, select **Create**, and then select **Database** to create a new database.

  ![create_database.png](../../images/create_database.png)

* Enter **animals_db** as the database name. Make sure the owner is set as the default postgres, and then click **Save**.

![animals_db.png](../../images/animals_db.png)

* At this point, you'll see a new database listed in the left-hand menu `animals_db`, but it's not yet connected to the server. By clicking on the database you'll create a connection to Postgres.

![new_db.png](../../images/new_db.png)

# ==========================================

### 1.02 Instructor Do: Create a Table (10 mins)

* From the left-hand menu in pgAdmin, right-click **animals_db** and select **Query Tool**.

  **Note:** You can also select **Query Tool** from the Tools drop-down menu at the top of the screen. (See second screenshot below.)

![query_tool.png](../../images/query_tool.png)

![tools_dropdown.png](../../images/tool_dropdown.png)

* Type the following lines of code, explaining each line:

  ```sql
  CREATE TABLE people (
    name VARCHAR(30) NOT NULL,
    has_pet BOOLEAN DEFAULT false,
    pet_type VARCHAR(10) NOT NULL,
    pet_name VARCHAR(30),
    pet_age INT
  );
  ```

* After reviewing the code, click the lightning bolt icon to run the script. Make a note of the Messages tab at the bottom of the screen.

![lightning_bolt.png](../../images/lightning_bolt.png)

* Alternative method: Highlight the lines of code to run, and then click the lightning bolt icon to run only the highlighted selection. This method of running SQL code is preferable to deleting previous code.

![Select.png](../../images/Select.png)

* Type the following code to `INSERT` and to `SELECT` what you inserted.

  ```sql
  INSERT INTO people (name, has_pet, pet_type, pet_name, pet_age)
  VALUES ('Jacob', true, 'dog', 'Misty', 10),
    ('Ahmed', true, 'rock', 'Rockington', 100),
    ('Peter', true, 'cat', 'Franklin', 2),
    ('Dave', true, 'dog', 'Queso', 1);

  SELECT *
  FROM people;
  ```

* Use the following code to query the table, extracting only the `pet_name`.

  ```sql
  SELECT pet_name
  FROM people;
  ```

* Filter the queried data to display only dogs younger than 5.

  ```sql
  SELECT pet_type, pet_name
  FROM people
  WHERE pet_type = 'dog'
  AND pet_age < 5;
  ```

# ==========================================

### 1.03 Student Do: Creating Tables (10 mins)

## Creating Tables

In this activity, you will use pgAdmin to recreate and query a table based on image provided to you.

### Instructions

1. Create a new database in pgAdmin named `city_info`.

2. Using the query tool, create an empty table named `cities`. Be sure to match the data types!

3. Insert data into the new table. The result should match the following image.


![cities_table.png](../../images/cities_table.png)

4. Query the table to recreate the image below.

![cities_only.png](../../images/cities_only.png)

### Bonus

1. Filter the table to view only cities in Arizona.

2. Filter the table to view only cities with a population of less than 100,000.

3. Filter the table to view California cities with a population of less than 100,000.

### Hints

* For the second bonus question, you will need to use a [`WHERE` clause](https://www.tutorialspoint.com/sql/sql-where-clause.htm) to filter the original query.

* For the third bonus question, an [`AND` clause](https://www.tutorialspoint.com/sql/sql-and-or-clauses.htm) will also be necessary.

### Solution

```sql
-- Create a new table
CREATE TABLE cities (
  city VARCHAR(30) NOT NULL,
  state VARCHAR(30) NOT NULL,
  population INT
);
```

```sql
-- Insert data into the table
INSERT INTO cities (city, state, population)
 VALUES ('Alameda', 'California', 79177),
  ('Mesa', 'Arizona', 496401),
  ('Boerne', 'Texas', 16056),
  ('Anaheim', 'California', 352497),
  ('Tucson', 'Arizona', 535677),
  ('Garland', 'Texas', 238002);
```

```sql
-- View the table data
SELECT *
  FROM cities;
```

```sql
-- Use a query to view only the cities
SELECT city
  FROM cities;
```

```sql
-- Bonus 1:
-- Create a query to view cities in Arizona
SELECT city, state
  FROM cities
  WHERE state = 'Arizona';
```

```sql
-- Bonus 2:
-- Create a query to view cities and states
-- with a population less than 100,000
SELECT *
  FROM cities
  WHERE population < 100000;
```

```sql
-- Bonus 3:
-- Create a query to view the city in California
-- with a population of less than 100,000
SELECT *
  FROM cities
  WHERE population < 100000
  AND state = 'California';
```

# ==========================================

### 1.04 Instructor Do: The Value of Unique Values (5 mins)

```sql
-- Delete the table "people"
DROP TABLE people;

-- Re-create the table "people" within animals_db
CREATE TABLE people (
  id SERIAL PRIMARY KEY,
  name VARCHAR(30) NOT NULL,
  has_pet BOOLEAN DEFAULT false,
  pet_type VARCHAR(10) NOT NULL,
  pet_name VARCHAR(30),
  pet_age INT
);


```

```sql
-- Insert data into the table
INSERT INTO people (name, has_pet, pet_type, pet_name, pet_age)
 VALUES ('Jacob', true, 'dog', 'Misty', 10),
  ('Ahmed', true, 'rock', 'Rockington', 100),
  ('Ahmed', true, 'rock', 'Rockington', 100),
  ('Peter', true, 'cat', 'Franklin', 2),
  ('Dave', true, 'dog', 'Queso', 1),
  ('Dave', true, 'dog', 'Pringles', 7);

```

```sql
-- Query all fields from the table
SELECT *
 FROM people;

```

```sql
-- Query the data to return all the rows containing the name "Dave"
SELECT id, name, pet_name, pet_age
 FROM people
 WHERE name = 'Dave';

```

```sql
-- Update a single row to change the `pet_name` and `pet_age` column data
UPDATE people
 SET has_pet = true, pet_name = 'Rocket', pet_age = 8
 WHERE id = 6;

SELECT *
 FROM people;

```

```sql
-- Delete the duplicate entry using a unique id
DELETE FROM people
 WHERE id = 3;

SELECT *
 FROM people;
```

# ==========================================

### 1.05 Student Do: Making and Using an ID (10 mins)

## Making and Using an ID

In this activity, you will recreate a table and then query, insert, and update data.

### Instructions

1. Create a new database named `programming_db`. 

2. Recreate the `programming_languages` table using the following image.


![programming_languages.png](../../images/programming_languages.png)

3. Query the table to return the rows containing MySQL, and then delete one of the duplicates.

4. Insert a few more rows of data for additional programming languages by adding the `language` and `rating` of your choice to the `programming_languages` table.

5. Change the name of the JS language to JavaScript.

6. Change the rating for HTML to 90.

### Bonus

* Research how to add columns to a table. Then create a Boolean column named `mastered` that  has a default value of `true`.

* Start looking into the concept of joins in SQL. (This concept will be covered later in the lesson.)

### Solution

```sql
-- Drop table if exists
DROP TABLE programming_languages;

```

```sql
-- Create new programming_languages table
CREATE TABLE programming_languages (
  id SERIAL PRIMARY KEY,
  language VARCHAR(20),
  rating INT
);
```

```sql
-- Insert new data
INSERT INTO programming_languages (language, rating)
  VALUES ('HTML', 95),
	('JS', 99),
	('JQuery', 98),
	('MySQL', 70),
	('MySQL', 70);

SELECT * FROM programming_languages;

```

```sql
-- Query the rows with the language "MySQL"
SELECT *
  FROM programming_languages
  WHERE language = 'MySQL';

```

```sql
-- Drop a duplicate row
DELETE FROM programming_languages
  WHERE id = 5;

SELECT *
  FROM programming_languages;

```

```sql
-- Add additional data
INSERT INTO programming_languages (language, rating)
  VALUES ('Python', 98),
	('C++', 73),
	('R', 95);

SELECT *
  FROM programming_languages;

```

```sql
-- Update "JS" to "JavaScript"
UPDATE programming_languages
  SET language = 'JavaScript'
  WHERE id = 2;

SELECT *
  FROM programming_languages;

```

```sql
-- Change HTML's rating to 90
UPDATE programming_languages
  SET rating = 90
  WHERE id = 1;

SELECT *
  FROM programming_languages;

```

```sql
-- BONUS
-- Add a "mastered" column with the boolean default of true
ALTER TABLE programming_languages
  ADD COLUMN mastered BOOLEAN default true;
```

# ==========================================

### BREAK (0:10)

# ==========================================

### 1.06 Instructor Do: Import Data (10 mins)

* **Files:**

  * [birdsong.csv](06-Ins_Importing_Data/Resources/birdsong.csv)

  * [query.sql](06-Ins_Importing_Data/Solved/query.sql)

Create database `Miscellaneous_DB`
```sql
CREATE DB Miscellaneous_DB;
```

```sql
-- Drop table if exists
DROP TABLE bird_song;

-- Create new table
CREATE TABLE bird_song (
	english_name VARCHAR,
	country VARCHAR,
	latitude DEC,
	longitude DEC
);


-- View table columns and datatypes
SELECT * FROM bird_song;
```

  * Open a query tool within `Miscellaneous_DB` and create a table named `bird_song`. Point out that the columns created match the data in the CSV file.

  * Once the table has been created, right-click **Miscellaneous_DB** from the left-hand menu and select **Refresh**.

  * Scroll down to Schemas and expand that menu, and then expand the Tables menu.

![table-expand.png](../../images/table-expand.png)

  * Right-click the new table and select **Import/Export** from the menu.

    ![import-export.png](../../images/import-export.png)

* In the Options tab, complete the following steps:

  * Slide the Import/Export tab to **Import**.

  * Click on the dot menu to navigate to the `birdsong.csv` file on your computer.

  * Slide the Header tab to **Yes**.

  * Select the comma from the drop-down menu to set it as the Delimiter.

  * Leave the other fields as they are, and then click **OK**.

![import.png](../../images/import.png)

# ==========================================

### 1.07 Student Do: Hide and Seek (10 mins)

# Hide and Seek

In this activity, you will create a new table and import data from a CSV file. To learn more about this dataset, you may review the reference at the end of this document.

## Instructions

1. Open the `soft-attributes.csv` CSV file from the Resources folder to analyze the data.

2. Using the column headers and data types from the CSV file, write the table schema to create a new table in the `Miscellaneous_DB` database called `movie_words_comparison`.

3. Import the data from the `soft-attributes.csv` file in the Resources folder.

4. Create a query that collects all rows where `Home Alone (1990)` is in the `reference_title` column.

5. Create a query that collects all rows where the rater is within the 10-15 range.

6. Create a query that searches for the words `artsy` and `heartfelt` in the `soft_attribute` column.

## Bonus

* Create a query that will collect all rows with a reference title of `Batman (1989)` and a soft attribute of `scary`.

* Create a query that will collect all rows with a rater within the 30-40 range and has a reference title of `Home Alone (1990)` and a soft attribute of `artsy`.

## References

Krisztian Balog, Filip Radlinski and Alexandros Karatzoglou from Google LLC (2021). SoftAttributes: Relative movie attribute dataset for soft attributes. [https://github.com/google-research-datasets/soft-attributes](https://github.com/google-research-datasets/soft-attributes).

### Solution
```sql
-- Drop table if exists
-- Drop table if exists
DROP TABLE movie_words_comparison;

-- Create table and view column datatypes
CREATE TABLE movie_words_comparison (
	rater_id INT,
	reference_title VARCHAR,
	soft_attribute VARCHAR,
	less_than VARCHAR,
	about_as VARCHAR,
	more_than VARCHAR
);

SELECT * 
FROM movie_words_comparison;

-- Collect all rows where "Home Alone (1990)" is in the "reference_title" column
SELECT * 
FROM movie_words_comparison
WHERE reference_title = 'Home Alone (1990)';

-- Collect all rows where the rater is within the 10-15 range
SELECT *
FROM movie_words_comparison
WHERE
	rater_id >= 10
	AND rater_id <= 15;

-- Search for the words "artsy" and "heartfelt" in the "soft_attribute" column
SELECT *
FROM movie_words_comparison
WHERE
	soft_attribute = 'artsy'
	OR soft_attribute = 'heartfelt';

-- BONUS
-- Select all rows with a reference title of "Batman (1989)" and a soft attribute of "scary"
SELECT *
FROM movie_words_comparison
WHERE
	reference_title = 'Batman (1989)'
	AND soft_attribute = 'scary';

-- Collect all rows where the rater is within the 30-40 range and has a reference title of "Home Alone (1990)" and a soft attribute of "artsy"
SELECT *
FROM movie_words_comparison
WHERE
	reference_title = 'Home Alone (1990)'
	AND soft_attribute = 'artsy'
	AND rater_id >= 30
	AND rater_id <= 40;

```

# ==========================================

### 1.08 Instructor Do: CRUD (5 mins)

* In today's class, each of the operations has been in use. You have:

  * `C` Created data in a table with the `INSERT` statement.

  * `R` Read data with the use of `SELECT`.

  * `U` Updated a table's data using `UPDATE`.

  * `D` Deleted data using `DELETE`.

# ==========================================

### 1.08 Student Do: Using CRUD (10 mins)

# Using CRUD: Create, Read, Update, and Delete

In this activity, you will use CRUD operations (Create, Read, Update, Delete) on the provided data.

## Instructions

1. Create a new database named `Malaysia` in pgAdmin.

2. Create two new tables in the `Malaysia` database by copying the code provided in `schema.sql` into a new query window in pgAdmin.

3. Using the Import/Export tool, import the data from `mys_road_accidents.csv` into the `road_accidents` table, and then import the data from `mys_accidents_by_state.csv` into the `accidents_by_state` table.

4. In the `road_accidents` table, find the row that has a `road_crashes` value of 0 and note:

  * the year

  * the number of `road_deaths`

  * the names of the other two columns have missing data (0 values)

You will be able to calculate this missing data from the second table.

5. In the `accidents_by_state` table, delete all rows for years that do not have data missing from the `road_accidents` table.

6. In the `accidents_by_state` table, in a single SQL query, find the [Sum](https://www.w3schools.com/sql/sql_count_avg_sum.asp) of each of the three columns with missing data, as well as `road_deaths`, and rename the summed columns with their original column name using `AS`.

    * **Hint:** If you don’t rename the columns, the columns will have a name like `sum(road_deaths)`.

Compare the sum of `road_deaths` from these results with the value from the `road_accidents` table. If they do not match, the other values will also be incorrect.

7. Once the `road_deaths` values match up, note the values for the three columns with missing data, and update the `road_accidents` table with this new information.

## Bonus

* Delete all rows from `accidents_by_state` and re-import the data from `mys_accidents_by_state.csv`. If you import the data again without deleting the rows, you will have duplicated data.

* Without deleting any rows, calculate the sum of `road_crashes`, `road_deaths`, `serious_injury`, and `slight_injury` for a subsequent year, and add those values plus the year to the `road_accidents` table.

    **Note**: You will need to also include a value for `_id` as it has been designated the Primary Key and cannot be null, nor can it be a duplicate value of `_id`.

## References

Institut Penyelidikan Keselamatan Jalan Raya Malaysia (MIROS). General Road Accident Statistics in Malaysia. [https://www.data.gov.my/data/en_US/dataset/general-road-accident-statistics-in-malaysia](https://www.data.gov.my/data/en_US/dataset/general-road-accident-statistics-in-malaysia)

Royal Malaysian Police (PDRM). Road Accident Statistics by Type of Accident and Injury. [https://www.data.gov.my/data/ms_MY/dataset/statistik-kemalangan-jalan-raya-mengikut-jenis-kemalangan-dan-kecederaan](https://www.data.gov.my/data/ms_MY/dataset/statistik-kemalangan-jalan-raya-mengikut-jenis-kemalangan-dan-kecederaan)

---

```sql
-- Drop table if exists
DROP TABLE IF EXISTS road_accidents;

DROP TABLE IF EXISTS accidents_by_state;

-- Create new tables to import data
CREATE TABLE road_accidents (
	_id	INT PRIMARY KEY,
	Year INT,
	Registered_Vehicles	INT,
	Population INT,
	Road_Crashes INT,
	Road_Deaths INT,
	Serious_Injury INT,
	Slight_Injury INT,
	Index_per_10000_Vehicles DEC,
	Index_per_100000_Population DEC,	
	Index_per_billion_VKT DEC
);

CREATE TABLE accidents_by_state (
	Year INT,
	MYS_State VARCHAR,
	Road_Crashes INT,
	Road_Deaths INT,
	Serious_Injury INT,
	Slight_Injury INT
);

-- Import data from mys_road_accidents.csv
-- View the table to ensure all data has been imported correctly
SELECT * FROM road_accidents;

-- Import data from mys_accidents_by_state.csv
-- View the table to ensure all data has been imported correctly
SELECT * FROM accidents_by_state;

```

* Query

```sql
-- Find row with missing data
SELECT * FROM road_accidents WHERE road_crashes = 0;

-- Note columns with missing data: road_crashes, serious_injury, slight_injury
-- Note year = 2017
-- Note road_deaths = 6740

-- Delete rows
DELETE FROM accidents_by_state
WHERE year != 2017;

-- Calculate the missing data and rename columns
SELECT SUM(road_crashes) AS road_crashes,
	SUM(serious_injury) AS serious_injury,
	SUM(slight_injury) AS slight_injury,
	SUM(road_deaths) AS road_deaths
FROM accidents_by_state;

-- Make note of them
-- road_crashes = 533875,
-- serious_injury = 3310,
-- slight_injury = 6539
-- road_deaths = 6740

-- Update missing data
UPDATE road_accidents
SET road_crashes = 533875,
	serious_injury = 3310,
	slight_injury = 6539
WHERE Year = 2017;

-- View table
SELECT * FROM road_accidents;

-- BONUS

-- Delete all rows
DELETE FROM accidents_by_state;

-- Remember to re-import from mys_accidents_by_state.csv

-- Calculate the data for year 2018
SELECT SUM(road_crashes) AS road_crashes,
	SUM(road_deaths) AS road_deaths,
	SUM(serious_injury) AS serious_injury,
	SUM(slight_injury) AS slight_injury
FROM accidents_by_state
WHERE year = 2018;

-- Insert new row
INSERT INTO 
road_accidents (_id, year, road_crashes, road_deaths, serious_injury, slight_injury)
VALUES (22, 2018, 548598,6284,2964,5377);

-- View table
SELECT * FROM road_accidents;
```

# ==========================================

### 1.09 Instructor Do: Joins (10 mins)

![Join](../../images/PostgreSQL-Joins.png)

```sql
-- Drop table if exists
DROP TABLE names;

-- Create the names table
CREATE TABLE names (
	i INT PRIMARY KEY,
	dep_id INT,
	line INT,
	name VARCHAR,
	status VARCHAR,
	inserted_by VARCHAR,
	insert_date DATE,
	updated_by VARCHAR,
	update_date DATE
);

-- Check data import
SELECT *
FROM names;

-- Create the commodity table
CREATE TABLE commodity (
	i INT PRIMARY KEY,
	dep_id INT,
	line INT,
	commod VARCHAR,
	code VARCHAR,
	commod_tp VARCHAR,
	commod_group VARCHAR,
	import VARCHAR,
	inserted_by VARCHAR,
	insert_date DATE,
	updated_by VARCHAR,
	update_date DATE
);

-- Check data import
SELECT *
FROM commodity;

-- Perform an INNER JOIN on the two tables
SELECT names.name, commodity.commod, commodity.commod_tp, commodity.commod_group
FROM names
INNER JOIN commodity ON
commodity.dep_id=names.dep_id;

-- Alternative solution:
-- Perform an INNER JOIN on the two tables
SELECT n.name, c.commod, c.commod_tp, c.commod_group
FROM names as n
INNER JOIN commodity as c ON
c.dep_id=n.dep_id;
```

* There are five primary types of joins that can be used with PostgreSQL:

  * `INNER JOIN` returns records that have matching values in both tables.

  * `LEFT JOIN` returns all records from the left table and the matched records from the right table.

  * `RIGHT JOIN` returns all records from the right table and the matched records from the left table.

  * `CROSS JOIN` returns records that match every row of the left table with every row of the right table. This type of join has the potential to make very large tables.

  * `FULL OUTER JOIN` places null values within the columns that do not match between the two tables, after an inner join is performed.

# ==========================================

### 1.10 Student Do: Joining the NBA (10 mins)

# Joining Bird Bands

When information could unintentionally be duplicated, data is often stored in separate tables with reference to an `id`. In the case of the dataset you will explore, most of the unique identifiers are labeled with the word `code`.

In this activity, you will be using joins to learn more about North American bird banding. The example contains data reduced from its original source, so if you would like to explore the data further, click the link in the Reference section.

## Instructions

* Create a new database named `bird_banding_DB`, and create eight new tables with pgAdmin named `bird_bands`, `age`, `band_type`, `bird_status`, `country_state`, `event_type`, `extra_info` and `sex`.

* Copy the code from `schema.sql` to create the tables, and then import the corresponding data from the CSV files with the same names. **Note:** Remember to refresh the database. Newly created tables will not immediately appear.

* Perform joins that will generate the following outputs:

  * Basic Information Table:


  | | band<br>character varying | event_date<br>character varying | species_name<br>character varying | age_description<br>character varying | sex_description<br>character varying |
  |----|----|----|----|----|----|
  | 1 | B06814289038 | 5/22/02 | Warbling Vireo | After Hatching Year | Unknown |
  | 2 | B06834226076 | 2/5/97 | White-eyed Vireo | After Hatching Year | Unknown |
  | 3 | B06834537033 | 9/28/01 | Red-eyed Vireo | After Hatching Year | Unknown |
  | 4 | B06834538078 | 9/6/01 | Red-eyed Vireo | Hatching Year | Unknown |
  | 5 | B06834760300 | 2/8/96 | La Sagra's Flycatcher | After Hatching Year | Unknown |
  | 6 | B06834762078 | 12/8/95 | La Sagra's Flycatcher | Unknown | Unknown |
  | 7 | B06834824074 | 2/9/96 | Yellow-bellied Flycatcher | After Hatching Year | Unknown |
  | 8 | B07033377537 | 2/26/19 | Yellow-bellied Flycatcher | Second Year | Unknown |
  | 9 | B07033378413 | 12/20/18 | Yellow-bellied Flycatcher | Hatching Year | Unknown |
  | 10 | B07033378577 | 12/5/18 | Yellow-bellied Flycatcher | Unknown | Unknown |

  * Extended Information where sex is not unknown:</br>


  | | band<br>character varying | event_date<br>character varying | species_name<br>character varying | band_type_description<br>character varying | bird_status_description<br>character varying | age_description<br>character varying | sex_description<br>character varying |
  |----|----|----|----|----|----|----|----|
  | 1 | B07324722072 | 6/22/15 | Bahama Swallow | aluminum\butt-end (toll-free /web address) | Normal wild bird. | After Hatching Year | Female |
  | 2 | B07383058128 | 7/15/13 | Black-capped Vireo | aluminum\butt-end (toll-free /web address) | Normal wild bird. | Hatching Year | Male |
  | 3 | B07383058283 | 7/12/13 | Black-capped Vireo | aluminum\butt-end (toll-free /web address) | Normal wild bird. | Hatching Year | Male |
  | 4 | B07404371540 | 3/18/14 | Black-whiskered Vireo | aluminum\butt-end (toll-free /web address) | Normal wild bird. | After Second Year | Female |
  | 5 | B07423509254 | 9/9/11 | Vermilion Flycatcher | aluminum\butt-end toll free | Normal wild bird. | After Hatching Year | Male |
  | 6 | B07463640300 | 4/3/11 | Northern Rough-winged Swallow | aluminum\butt-end (toll-free /web address) | Normal wild bird. | After Hatching Year | Female |
  | 7 | B07463640387 | 4/3/11 | Northern Rough-winged Swallow | aluminum\butt-end (toll-free /web address) | Normal wild bird. | After Hatching Year | Male |
  | 8 | B01924380221 | 2/13/06 | Tropical Kingbird | aluminum\butt end | Normal wild bird. | After Second Year | Male |
  | 9 | B01974875034 | 4/7/00 | Gray Kingbird | aluminum\butt end | Normal wild bird. | After Hatching Year | Female |
  | 10 | B07514549034 | 3/29/11 | Tropical Kingbird | aluminum\butt-end (toll-free /web address) | Normal wild bird. | After Second Year | Male |
  | 11 | B08623850540 | 1/11/75 | Yellow-bellied Flycatcher | aluminum\butt end | Normal wild bird. | Second Year | Male |
  | 12 | B08623850863 | 2/12/75 | Least Flycatcher | aluminum\butt end | Normal wild bird. | After Hatching Year | Female |

  * **Note:** You will need to include a `WHERE` clause on sex_description.

## Reference

Celis-Murillo, A., Malorodova, M., and Nakash, E., 2020, North American Bird Banding Program Dataset 1960-2020 retrieved 2020-06-26: U.S. Geological Survey data release, [https://doi.org/10.5066/P9R1L6Q7](https://doi.org/10.5066/P9R1L6Q7).
Specifically files NABBP_2020_grp_06.csv [reduced in pandas to locations outside of the US and Canada] and NABBP_Lookups_2020.zip

```sql
-- Join bird_bands with age and sex
SELECT bird_bands.band, 
  bird_bands.event_date, 
  bird_bands.species_name, 
  age.age_description, 
  sex.sex_description
FROM bird_bands
INNER JOIN age ON bird_bands.age_code = age.age_code
INNER JOIN sex ON bird_bands.sex_code = sex.sex_code;

-- Join bird_bands with age and sex using aliases
SELECT b.band, 
  b.event_date, 
  b.species_name, 
  a.age_description, 
  s.sex_description
FROM bird_bands as b 
INNER JOIN age as a ON b.age_code = a.age_code
INNER JOIN sex as s ON b.sex_code = s.sex_code;

-- Join bird_bands with band_type, bird_status, age, sex
-- where sex_description is not "Unknown"
SELECT bird_bands.band, 
	bird_bands.event_date, 
	bird_bands.species_name, 
	band_type.band_type_description, 
	bird_status.bird_status_description, 
	age.age_description, 
	sex.sex_description
FROM bird_bands
INNER JOIN band_type ON bird_bands.band_type_code = band_type.band_type_code
INNER JOIN bird_status ON bird_bands.bird_status = bird_status.bird_status
INNER JOIN age ON bird_bands.age_code = age.age_code
INNER JOIN sex ON bird_bands.sex_code = sex.sex_code
WHERE sex_description != 'Unknown';

-- Join bird_bands with band_type, bird_status, age, sex using aliases
-- where sex_description is not "Unknown"
SELECT b.band, 
	b.event_date, 
	b.species_name, 
	bt.band_type_description, 
	bs.bird_status_description, 
	a.age_description, 
	s.sex_description
FROM bird_bands as b
INNER JOIN band_type as bt ON b.band_type_code = bt.band_type_code
INNER JOIN bird_status as bs ON b.bird_status = bs.bird_status
INNER JOIN age as a ON b.age_code = a.age_code
INNER JOIN sex as s ON b.sex_code = s.sex_code
WHERE sex_description != 'Unknown';

SELECT * FROM bird_bands;
```

# ==========================================

# Extra info:

---

| Name 	| Aliases 	| Description
|:-----|:-----|:-----|
| bigint 	| int8 	| signed eight-byte integer
| bigserial 	| serial8 	| autoincrementing eight-byte integer
| bit [ (n) ] | 	  	| fixed-length bit string
| bit varying [ (n) ] 	| varbit [ (n) ] 	| variable-length bit string
| boolean 	| bool 	| logical Boolean (true/false)
| box 	|   	| rectangular box on a plane
| bytea | 	  	| binary data ("byte array")
| character [ (n) ] 	| char [ (n) ] 	| fixed-length character string
| character varying [ (n) ] 	| varchar [ (n) ] 	| variable-length character string
| cidr 	|   	| IPv4 or IPv6 network address
| circle 	|   	| circle on a plane
| date 	|   	| calendar date (year, month, day)
| double precision 	| float8 	| double precision floating-point number (8 bytes)
| inet 	|   	| IPv4 or IPv6 host address
| integer 	| int, int4 	| signed four-byte integer
| interval [ fields ] [ (p) ] 	|   	| time span
| json 	|   	| textual JSON data
| jsonb 	|   	| binary JSON data, decomposed
| line 	|   	| infinite line on a plane
| lseg 	|   	| line segment on a plane
| macaddr 	|   	| MAC (Media Access Control) address
| money 	|   	| currency amount
| numeric [ (p, s) ] 	| decimal [ (p, s) ] 	| exact numeric of selectable precision
| path 	|   	| geometric path on a plane
| pg_lsn 	|   	| PostgreSQL Log Sequence Number
| point 	|   	| geometric point on a plane
| polygon 	|   	| closed geometric path on a plane
| real 	| float4 	| single precision floating-point number (4 bytes)
| smallint 	| int2 	| signed two-byte integer
| smallserial 	| serial2 	| autoincrementing two-byte integer
| serial 	| serial4 	| autoincrementing four-byte integer
| text 	|   	| variable-length character string
| time [ (p) ] [ without time zone ] 	|   	| time of day (no time zone)
| time [ (p) ] with time zone 	| timetz 	| time of day, including time zone
| timestamp [ (p) ] [ without time zone ] 	|   	| date and time (no time zone)
| timestamp [ (p) ] with time zone 	| timestamptz 	| date and time, including time zone
| tsquery 	|   	| text search query
| tsvector | 	  	| text search document
| txid_snapshot | 	  	| user-level transaction ID snapshot
| uuid 	|   	| universally unique identifier
| xml 	|   	| XML data

## MySql Types
---

**Numeric types and lengths**

| Data Type | Storage Required   |
|------|:------|
| TinyInteger: | `2^(8*1)`	= 256 |
| SmallInteger: | `2^(8*2)`	= 65,536 |
| MediumInteger: | `2^(8*3)`	= 16,777,216 |
| Integer: | `2^(8*4)`	= 4,294,967,296 |
| BigInteger: | `2^(8*8)`	= 18,446,744,073,709,551,616 |


---

**TEXT/BLOB**

| Data Type | Storage Required   |
|------|:------|
| TINYTEXT: | `2^8 -1`	= 255 characters		- 255 B |
| TEXT: | `2^16 -1`	= 65,535 characters		- 64 KB |
| MEDIUMTEXT: | `2^24 -1`	= 16,777,215			- 16 MB |
| LONGTEXT: | `2^32 -1`	= 4,294,967,295 characters	- 4 GB |

---

**Numeric types and lengths**

| Data Type | Storage Required   |
|------|:------|
| TINYINT | `1 byte` |
| SMALLINT | `2 bytes` |
| MEDIUMINT | `3 bytes` |
| INT, INTEGER | `4 bytes` |
| BIGINT | `8 bytes` |
| FLOAT(p) | `4 bytes` if 0 <= p <= 24, `8 bytes` if 25 <= p <= 53 |
| FLOAT | `4 bytes` |
| DOUBLE [PRECISION], REAL | `8 bytes` |
| DECIMAL(M,D), NUMERIC(M,D) | Varies; |
| BIT(M) | approximately `(M+7)/8 bytes` |

---

**Date types and lengths**

| Data Type | Storage Required   |
|------|:------|
| YEAR | `1 byte` 	1 byte |
| DATE | `3 bytes` 	3 bytes |
| TIME | `3 bytes` 	3 bytes + fractional seconds storage |
| DATETIME | `8 bytes` 	5 bytes + fractional seconds storage |
| TIMESTAMP | `4 bytes` 	4 bytes + fractional seconds storage |

---

**TEXT/BLOB types and lengths**

| Data Type | Storage Required   |
|------|:------|
| CHAR(M) | The compact family of InnoDB row formats optimize storage for variable-length character sets. See COMPACT Row Format Storage Characteristics. Otherwise, M × w bytes, <= M <= 255, where w is the number of bytes required for the maximum-length character in the character set. |
| BINARY(M) | M bytes, 0 <= M <= 255 |
| VARCHAR(M), VARBINARY(M) | L + 1 bytes if column values require 0 ? 255 bytes, L + 2 bytes if values may require more than 255 bytes |
| TINYBLOB, TINYTEXT | L + 1 bytes, where L < 28 |
| BLOB, TEXT | L + 2 bytes, where L < 216 |
| MEDIUMBLOB, MEDIUMTEXT | L + 3 bytes, where L < 224 |
| LONGBLOB, LONGTEXT | L + 4 bytes, where L < 232 |
| ENUM('value1','value2',...) | 1 or 2 bytes, depending on the number of enumeration values (65,535 values maximum) |
| SET('value1','value2',...) | 1, 2, 3, 4, or 8 bytes, depending on the number of set members (64 members maximum) |
`------------------------------`

---

# ==========================================

### Rating Class Objectives

* rate your understanding using 1-5 method in each objective

In [ ]:
title = "09-SQL - Day 1 - Introduction to SQL"
objectives = [
    "Install and run Postgres and pgAdmin on their computers",
    "Create a database and tables using pgAdmin",
    "Define SQL data types, primary keys, and unique values",
    "Load CSV files into a database and query the data",
    "Articulate the four basic functions of persistent storage (CRUD) and apply this set of functions to a database",
    "Combine data from multiple tables using JOINs.",
]
rating = []
total = 0
for i in range(len(objectives)):
    rate = input(objectives[i]+"? ")
    total += int(rate)
    rating.append(objectives[i] + ". (" + rate + "/5)")
print("="*96)
print(f"Self Evaluation for: {title}")
print("-"*24)
for i in rating:
    print(i)
print("-"*64)
print("Average: " + str(total/len(objectives)))